Carl-1999/stm32-quadcopter/程序源码/00-四轴飞行器程序/Module/MyI2C2.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"

void MyI2C2_W_SCL(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOB, GPIO_Pin_10, (BitAction)BitValue);
}

void MyI2C2_W_SDA(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOB, GPIO_Pin_11, (BitAction)BitValue);
}

uint8_t MyI2C2_R_SDA(void)
{
	uint8_t BitValue;
	BitValue = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_11);
	return BitValue;
}

void MyI2C2_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_SetBits(GPIOB, GPIO_Pin_10 | GPIO_Pin_11);
}

void MyI2C2_Start(void)
{
	MyI2C2_W_SDA(1);
	MyI2C2_W_SCL(1);
	MyI2C2_W_SDA(0);
	MyI2C2_W_SCL(0);
}

void MyI2C2_Stop(void)
{
	MyI2C2_W_SDA(0);
	MyI2C2_W_SCL(1);
	MyI2C2_W_SDA(1);
}

void MyI2C2_SendByte(uint8_t Byte)
{
	uint8_t i;
	for (i = 0; i < 8; i ++)
	{
		MyI2C2_W_SDA(!!(Byte & (0x80 >> i)));
		MyI2C2_W_SCL(1);
		MyI2C2_W_SCL(0);
	}
}

uint8_t MyI2C2_ReceiveByte(void)
{
	uint8_t i, Byte = 0x00;
	MyI2C2_W_SDA(1);
	for (i = 0; i < 8; i ++)
	{
		MyI2C2_W_SCL(1);
		if (MyI2C2_R_SDA()){Byte |= (0x80 >> i);}
		MyI2C2_W_SCL(0);
	}
	return Byte;
}

void MyI2C2_SendAck(uint8_t AckBit)
{
	MyI2C2_W_SDA(AckBit);
	MyI2C2_W_SCL(1);
	MyI2C2_W_SCL(0);
}

uint8_t MyI2C2_ReceiveAck(void)
{
	uint8_t AckBit;
	MyI2C2_W_SDA(1);
	MyI2C2_W_SCL(1);
	AckBit = MyI2C2_R_SDA();
	MyI2C2_W_SCL(0);
	return AckBit;
}
